data_analysis/repo/gpu_log/benchmark_20250629_224610_mDeepSeek-R1-Distill-Llama-70B_np300_mc140_in2048_out2048.log
INFO 06-29 22:46:15 [__init__.py:243] Automatically detected platform cuda.
Namespace(backend='vllm', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=140, model='deepseek-ai/DeepSeek-R1-Distill-Llama-70B', tokenizer=None, use_beam_search=False, num_prompts=300, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['input_len=2048', 'output_len=2048', 'serving=vllm'], result_dir='gpu_log', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=2048, random_output_len=2048, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 140
100%|██████████| 300/300 [01:21<00:00,  3.67it/s]
============ Serving Benchmark Result ============
Successful requests:                     300       
Benchmark duration (s):                  81.83     
Total input tokens:                      614100    
Total generated tokens:                  329923    
Request throughput (req/s):              3.67      
Output token throughput (tok/s):         4031.82   
Total Token throughput (tok/s):          11536.42  
---------------Time to First Token----------------
Mean TTFT (ms):                          357.22    
Median TTFT (ms):                        104.42    
P99 TTFT (ms):                           1136.88   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          25.71     
Median TPOT (ms):                        26.15     
P99 TPOT (ms):                           32.73     
---------------Inter-token Latency----------------
Mean ITL (ms):                           25.28     
Median ITL (ms):                         25.61     
P99 ITL (ms):                            35.66     
==================================================