data_analysis/repo/gpu_log/benchmark_20250630_043655_mDeepSeek-R1-Distill-Llama-70B_np200_mc120_in512_out1024.log
INFO 06-30 04:37:00 [__init__.py:243] Automatically detected platform cuda.
Namespace(backend='vllm', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=120, model='deepseek-ai/DeepSeek-R1-Distill-Llama-70B', tokenizer=None, use_beam_search=False, num_prompts=200, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['input_len=512', 'output_len=1024', 'serving=sglang'], result_dir='gpu_log', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=512, random_output_len=1024, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 120
100%|██████████| 200/200 [00:33<00:00,  5.98it/s]
============ Serving Benchmark Result ============
Successful requests:                     200       
Benchmark duration (s):                  33.44     
Total input tokens:                      102200    
Total generated tokens:                  165507    
Request throughput (req/s):              5.98      
Output token throughput (tok/s):         4949.85   
Total Token throughput (tok/s):          8006.36   
---------------Time to First Token----------------
Mean TTFT (ms):                          267.77    
Median TTFT (ms):                        347.26    
P99 TTFT (ms):                           432.27    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          17.23     
Median TPOT (ms):                        18.04     
P99 TPOT (ms):                           19.19     
---------------Inter-token Latency----------------
Mean ITL (ms):                           17.23     
Median ITL (ms):                         15.97     
P99 ITL (ms):                            44.76     
==================================================