data_analysis/repo/gpu_log/benchmark_20250630_044212_mDeepSeek-R1-Distill-Llama-70B_np200_mc120_in1024_out1536.log
INFO 06-30 04:42:17 [__init__.py:243] Automatically detected platform cuda.
Namespace(backend='vllm', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=120, model='deepseek-ai/DeepSeek-R1-Distill-Llama-70B', tokenizer=None, use_beam_search=False, num_prompts=200, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['input_len=1024', 'output_len=1536', 'serving=sglang'], result_dir='gpu_log', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=1536, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 120
100%|██████████| 200/200 [00:43<00:00,  4.60it/s]
============ Serving Benchmark Result ============
Successful requests:                     200       
Benchmark duration (s):                  43.44     
Total input tokens:                      204600    
Total generated tokens:                  194907    
Request throughput (req/s):              4.60      
Output token throughput (tok/s):         4486.86   
Total Token throughput (tok/s):          9196.85   
---------------Time to First Token----------------
Mean TTFT (ms):                          365.02    
Median TTFT (ms):                        523.49    
P99 TTFT (ms):                           625.19    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          19.25     
Median TPOT (ms):                        19.42     
P99 TPOT (ms):                           23.05     
---------------Inter-token Latency----------------
Mean ITL (ms):                           18.87     
Median ITL (ms):                         17.44     
P99 ITL (ms):                            55.84     
==================================================